const gameStates = [
  {
    id: 0,
    text: `
    Ви прокидаєтесь посеред лісу зі світлом проникаючим крізь густі гілля. 
    Довкола вас повний тиші, і ви не пам'ятаєте, як сюди потрапили. 
    Ви розумієте, що ваша мета - вибратися з цього лісу.
    Перед Вами є декілька предметів, але Ви можете зяти тільки один. Який Оберете?
    `,
    options: [
      { text: "Глечик Меду", nextId: 1,state:{honey:true} },
      { text: "Бінокль", nextId: 1, state:{binocular:true} },
      { text: "Мотузку", nextId: 1, state:{rope:true} },
    ],
  },
  {
    id: 101,
    text: `Ви знаєте, що програш - це лише тимчасова перешкода на вашому шляху до успіху,
          і ви готові піднятися знову і продовжити свою подорож.
          Ви готові до нової спроби. Нехай ваша наступна подорож буде повна пригод та незабутніх моментів!
          Тепер ви готові розпочати заново і зробити новий вибір.  `,
    options: [
      { text: "Спробувати Знову", nextId: 0 },
    ],
  },
  {
    id: 1,
    text: `
    Супер! Ви вибрали собі предмет, тепер можемо починати подорож.Ви стоїте на перехресті, де виходять три стежки. 
    Який шлях ви оберете:
    `,
    options: [
      { text: "Вгору на пагорб", nextId: 2 },
      { text: "Спуститеся до річки", nextId: 3 },
      { text: "Прямо углиб лісу", nextId: 4 },
    ],
  },
  {
    id: 2,
    text: `Ви обираєте стежку, що веде вгору на пагорб. Піднімаючись по стежці, ви відчуваєте збільшення нахилу і зусильно крокуєте вгору. 
    Після тривалого підйому ви досягаєте вершини пагорба. Здивовано ви розглядаєте навколо себе і бачите захоплюючий панорамний вид на навколишній ліс.
    З вершини пагорба ви помічаєте дві можливі дороги. Який шлях ви оберете: `,
    options: [
      { text: "Вздовж гірського хребта", nextId: 5 },
      { text: "Прямо углиб лісу", nextId: 4 },
    ],
  },
  {
    id: 3,
    text: `Ви обираєте стежку, що спускається до річки. Прогресуючи вниз, ви чуєте шум води, який стає все гучнішим по мірі наближення до річки.
           Приходячи до берега, ви бачите, як річка повільно пливе своїм широким руслом. Ви помічаєте невеликий човен, що висить біля берега.`,
    options: [
      { text: "Використати човен і переплисти річку", nextId: 6 },
      { text: "Продовжите йти вздовж берега", nextId: 7 },
    ],
  },
  {
    id: 4,
    text: `Ви обираєте стежку углиб лісу, яка зникає у гущавині. Поступово ви прокладаєте собі шлях через густу рослинність, намагаючись проникнути глибше в ліс.
     Сонячні промені пробиваються крізь верхні гілки, створюючи мальовничу гру світла і тіні.
     Продовжуючи свій шлях, ви почуваєте, що стежка стає все вузьшою, а дерева - вищими й густишими.
     Відчуття таємниці витає у повітрі, і ви починаєте відчувати легке хвилювання.
     Серед гілок та листя ви помічаєте легендарну постать - величного та древнього лісового духа.
     Лісовий дух вас розпізнає і звертається до вас: "Вітаю, подорожнику! Ти обрав шлях глибше в ліс, де таємниці переплітаються з реальністю.
     Але будь обережний, бо не все так просто, як здається. Продовжуючи рух далі - тебе може чекати небезпека`,
    options: [
      { text: "Продовжувати рух далі", nextId: 8 },
      { text: "Повернутися назад", nextId: 9 },
    ],
  },
  {
    id: 5,
    text: `На хребті йдем і бачимо вказівник`,
    options: [
      { text: "Спуск до річки", nextId: 3 },
      { text: "Піднятися на Найвищу гору", nextId: 11 },
    ],
  },
  {
    id: 6,
    text: `Вода у потоці кришталево-чиста, і ви можете помітити рибок, що стрімко пливуть по течії.
            Продовжуючи свій шлях, ви помічаєте вдаліше щось на дні потоку.
             Це виглядає як розколотий камінь з якоюсь дрібницею всередині. Чи вирішите ви зануритися і взяти цю річку?`,
    options: [
      { text: "Пірнути і забрати", nextId: 12, state:{crystal:true} },
      { text: "Продовжувати пливти далі", nextId: 13 },
    ],
  },
  {
    id: 7,
    text: `Продовжуючи свій шлях вздовж гірського потоку, ви замічаєте, як стежка поступово розширюється, а зелені дерева змінюються на високі скелі. 
    Ви наближаєтеся до водоспаду, що злітає з високої кручі.
    Тепер ви знаходитеся перед важливим вибором:`,
    options: [
      { text: "Спробувати піднятися вгору по скелях, обходячи водоспад", nextId: 14 },
      { text: "Пройти через водоспад, ризикуючи бути змоченим", nextId: 15 },
    ],
  },
  {
    id: 8,
    text: `Рух Далі`,
    options: [
      { text: "16", nextId: 16 },
      { text: "17", nextId: 17 },
    ],
  },
  {
    id: 9,
    text: `Від лісового НАЗАД ЙДУ і побачив печеру з  таємничим блиском`,
    options: [
      { text: "Зайду", nextId: 18 },
      { text: "Піду назад І виберу шлях до річки", nextId: 3 },
      { text: "Піду назад І виберу шлях на пагорб", nextId: 2 },
    ],
  },
  // {
  //   id: 10,
  //   text: `До річки`,
  //   options: [
  //     { text: "", nextId: 0 },
  //     { text: "", nextId: 0 },
  //   ],
  // },
  {
    id: 11,
    text: `Видерся на гору`,
    options: [
      { text: "19", nextId: 19 },
      { text: "20", nextId: 20 },
    ],
  },
  {
    id: 12,
    text: `Ви занурюєтеся у потік і піднімаєте розколотий камінь. Вибравши його з води, ви помічаєте, що всередині маленький кришталевий кулон з чарівним візерунком на ньому.
     Його краса захоплює вас, і ви збираєтеся зберегти його як амулет на вашій подорожі. Але доки Був під водою човен відплив`,
    options: [
      { text: "21", nextId: 21 },
      { text: "22", nextId: 22 },
    ],
  },
  {
    id: 13,
    text: `Пливу Далі на човні`,
    options: [
      { text: "23", nextId: 23 },
      { text: "24", nextId: 24 },
    ],
  },
  {
    id: 14,
    text: `Ви вирішуєте вилізти по скелях біля водоспаду і ризикувати своїм безпекою.
     Ваші руки шукають опору на гладких каменях, а ноги шукають стійку опору. 
     З кожним кроком ви відчуваєте, як вода з водоспаду бризкає вам у обличчя, надаючи вам сили і впевненості.
    Але, ось незворотний момент: ви розумієте, що маючи мотузку, якою можна б було зафіксуватися, можна врятуватися і подолати скелю.
     Вам спливають руки від поту, і ви відчуваєте, як втрачаєте стійкість. Серце б'ється швидше, а паніка поступово охоплює вас.`,
    options: [
      { text: "Використати мотузку", nextId: 31, requiredState:'rope'},
      { text: "І де ж я подів мотузку...", nextId: 101 },//----------------START OVER--------------

    ],
  },
  {
    id: 15,
    text: `Ви вирішуєте пройти через водоспад, ризикуючи бути змоченим.
     Ви підходите ближче до водоспаду і відчуваєте його потужний потік води, що обволікає вас холодним туманом.
     З великим розмахом ви прориваєтеся через струмок і впадаєте в потік, який впродовж кількох секунд змиває всю вашу втому.
     По той бік водоспаду ви виходите змоченим, але оживленим. Ваше волосся струшуються від води, а відчуття свіжості охоплює вас. Тепер перед вами відкривається незвідана печера`,
    options: [
      { text: "Зайти і обстежити", nextId: 25 },
      { text: "Я боягуз але сильний в руках, Повернуся і спробую піднятися по скелі", nextId: 14 },
    ],
  },
  {
    id: 16,
    text: `16`,
    options: [
      { text: "26", nextId: 26 },
      { text: "27", nextId: 27 },
    ],
  },
  {
    id: 17,
    text: `17`,
    options: [
      { text: "28", nextId: 28 },
      { text: "28", nextId: 29 },
    ],
  },
  {
    id: 18,
    text: `18`,
    options: [
      { text: "Дав МЕД ВЕДМЕДЮ", nextId: 30, requiredState:'honey'},  // required state Honey should be
      { text: "Вас ЗЖЕР ВІДМІДЬ", nextId: 1 },  // КІНЕЦЬ
    ],
  },
];

let initialState = {}

// Function to start the game
function startGame() {
initialState = {};
  const state = gameStates.find((state) => state.id === 0);
  showGameState(state);
}
function showOption(option) {
  console.log(initialState)
if (!option?.requiredState) return true
  return initialState[option.requiredState]
}
// Function to display the current game state
function showGameState(state) {
  // console.log(initialState)
  const textElement = document.getElementById("text");
  const optionsElement = document.getElementById("options");

  textElement.innerText = state.text;
  optionsElement.innerHTML = "";

  state.options.forEach((option) => {
   if (showOption(option)){
     const button = document.createElement("button");
     button.innerText = option.text;
     button.addEventListener("click", () => selectOption(option));
     optionsElement.appendChild(button);
   }
  });
}

// Function to handle option selection
function selectOption(option) {
  const nextState = gameStates.find((state) => state.id === option.nextId);

  initialState={...initialState,...option?.state}

  if (nextState) {
    showGameState(nextState);
  }
}

// Start the game
startGame();
