interface IOption {
    text: string;
    nextId: number;
    state?: string;
    requiredState?: {
        subject:string;
        isForDelete?:boolean;
    }
}

interface IGameState {
    id: number;
    text: string;
    options: IOption[]
}

const gameStates: IGameState[] = [
    {
        id: 0,
        text: `
    Ви прокидаєтесь посеред лісу зі світлом проникаючим крізь густі гілля. 
    Довкола вас повний тиші, і ви не пам'ятаєте, як сюди потрапили. 
    Ви розумієте, що ваша мета - вибратися з цього лісу.
    Перед Вами є декілька предметів, але Ви можете зяти тільки один. Який Оберете?
    `,
        options: [
            {text: "Глечик Меду", nextId: 1, state: 'honey'},
            {text: "Бінокль", nextId: 1, state: 'binoculars'},
            {text: "Мотузку", nextId: 1, state: 'rope'},
        ],
    },
    {
        id: 101,
        text: `Ви знаєте, що програш - це лише тимчасова перешкода на вашому шляху до успіху,
          і ви готові піднятися знову і продовжити свою подорож.
          Ви готові до нової спроби. Нехай ваша наступна подорож буде повна пригод та незабутніх моментів!
          Тепер ви готові розпочати заново і зробити новий вибір.  `,
        options: [
            {text: "Спробувати Знову", nextId: 0},
        ],
    },
    {
        id: 201,
        text: `Вітаю Ви Виграли!!!! `,
        options: [
            {text: "Зіграти ще раз?", nextId: 0},
        ],
    },
    {
        id: 1,
        text: `
    Супер! Ви вибрали собі предмет, тепер можемо починати подорож.Ви стоїте на перехресті, де виходять три стежки. 
    Який шлях ви оберете:
    `,
        options: [
            {text: "Вгору на пагорб", nextId: 2},
            {text: "Спуститеся до річки", nextId: 3},
            {text: "Прямо углиб лісу", nextId: 4},
        ],
    },
    {
        id: 2,
        text: `Ви обираєте стежку, що веде вгору на пагорб. Піднімаючись по стежці, ви відчуваєте збільшення нахилу і зусильно крокуєте вгору. 
    Після тривалого підйому ви досягаєте вершини пагорба. Здивовано ви розглядаєте навколо себе і бачите захоплюючий панорамний вид на навколишній ліс.
    З вершини пагорба ви помічаєте дві можливі дороги. Який шлях ви оберете: `,
        options: [
            {text: "Вздовж гірського хребта", nextId: 5},
            {text: "Прямо углиб лісу", nextId: 4},
        ],
    },
    {
        id: 3,
        text: `Ви обираєте стежку, що спускається до річки. Прогресуючи вниз, ви чуєте шум води, який стає все гучнішим по мірі наближення до річки.
           Приходячи до берега, ви бачите, як річка повільно пливе своїм широким руслом. Ви помічаєте невеликий човен, що висить біля берега.`,
        options: [
            {text: "Використати човен і переплисти річку", nextId: 6},
            {text: "Продовжите йти вздовж берега", nextId: 7,state: 'rope'},
        ],
    },
    {
        id: 4,
        text: `Ви обираєте стежку углиб лісу, яка зникає у гущавині. Поступово ви прокладаєте собі шлях через густу рослинність, намагаючись проникнути глибше в ліс.
     Сонячні промені пробиваються крізь верхні гілки, створюючи мальовничу гру світла і тіні.
     Продовжуючи свій шлях, ви почуваєте, що стежка стає все вузьшою, а дерева - вищими й густишими.
     Відчуття таємниці витає у повітрі, і ви починаєте відчувати легке хвилювання.
     Серед гілок та листя ви помічаєте легендарну постать - величного та древнього лісового духа.
     Лісовий дух вас розпізнає і звертається до вас: "Вітаю, подорожнику! Ти обрав шлях глибше в ліс, де таємниці переплітаються з реальністю.
     Але будь обережний, бо не все так просто, як здається. Продовжуючи рух далі - тебе може чекати небезпека`,
        options: [
            {text: "Продовжувати рух далі", nextId: 8},
            {text: "Повернутися назад", nextId: 9},
        ],
    },
    {
        id: 5,
        text: `На хребті йдем і бачимо вказівник`,
        options: [
            {text: "Спуск до річки", nextId: 3},
            {text: "Піднятися на Найвищу гору", nextId: 11},
        ],
    },
    {
        id: 6,
        text: `Вода у потоці кришталево-чиста, і ви можете помітити рибок, що стрімко пливуть по течії.
            Продовжуючи свій шлях, ви помічаєте вдаліше щось на дні потоку.
             Це виглядає як розколотий камінь з якоюсь дрібницею всередині. Чи вирішите ви зануритися і взяти цю річку?`,
        options: [
            {text: "Пірнути і забрати", nextId: 12, state: 'crystal'},
            {text: "Продовжувати пливти далі", nextId: 13},
        ],
    },
    {
        id: 7,
        text: `Продовжуючи свій шлях вздовж гірського потоку,ви помічаєте, що стежка поступово розширюється, а зелені дерева змінюються на високі скелі. 
    Ви наближаєтеся до водоспаду, що злітає з високої кручі.
    Тепер ви знаходитеся перед важливим вибором:`,
        options: [
            {text: "Спробувати піднятися вгору по скелях, обходячи водоспад", nextId: 14},
            {text: "Пройти через водоспад, ризикуючи бути змоченим", nextId: 15},
        ],
    },
    {
        id: 8,
        text: `Рух Далі`,
        options: [
            {text: "16", nextId: 16},
            {text: "17", nextId: 17},
        ],
    },
    {
        id: 9,
        text: `Від лісового НАЗАД ЙДУ і побачив печеру з  таємничим блиском`,
        options: [
            {text: "Зайду", nextId: 18,state: 'rope'},
            {text: "Піду назад І виберу шлях до річки", nextId: 3},
            {text: "Піду назад І виберу шлях на пагорб", nextId: 2},
        ],
    },
    // {
    //   id: 10,
    //   text: `До річки`,
    //   options: [
    //     { text: "", nextId: 0 },
    //     { text: "", nextId: 0 },
    //   ],
    // },
    {
        id: 11,
        text: `Поступово, ви побачили, як пейзаж починає змінюватися. 
        Дерева стають рідкішими, а повітря стає прохолоднішим та чистішим.
         Спершу далекий краєвид, а потім найпрекрасніший вид на весь ліс перед вами.
                Тепер ви стоїте на вершині гори.
                Ви, перебуваючи на вершині гори, маєте можливість спостерігати навколишній ландшафт. 
                Якщо у вас є бінокль, ви можете скористатися ним, щоб роздивитися найближчі об'єкти, зокрема вихід з лісу`,
        options: [
            {text: "Так, десь тут є він, скористаюся мабуть", nextId: 19, requiredState: {subject:'binoculars'} },
            {text: "Та ні, я маю орлиний зір, і так побачу", nextId: 20},
        ],
    },
    {
        id: 12,
        text: `Ви занурюєтеся у потік і піднімаєте розколотий камінь. Вибравши його з води, ви помічаєте, що всередині маленький кришталевий кулон з чарівним візерунком на ньому.
     Його краса захоплює вас, і ви збираєтеся зберегти його як амулет на вашій подорожі. Але доки пірнав, човен відплив. Що ж далі?`,
        options: [
            {text: "Спробую доплисти до човна", nextId: 13},
            {text: "Пливу до берега", nextId: 7},
        ],
    },
    {
        id: 13,
        text: `Продовжуючи плисти по річці, ви помічаєте, що природа стає все дикішою і незвичайнішою. 
        Вода стає мутною, дерева зводяться ущелинами, а звуки дикої природи наповнюють повітря. Ліс поглинає вас все більше і більше.
        Ви помічаєте далеко від річки стежку, яка здається прокладеною людиною. А токож ви помічаєте місце, де річка розщеплюється на два притоки. Ви можете, вибрати яким шляхом рухатися - лівим або правим.
        `,
        options: [
            {text: "Поверну на ліво", nextId: 23},
            {text: "Поверну на право", nextId: 24},
            {text: "Скористаюся стежкою", nextId: 25},
        ],
    },
    {
        id: 14,
        text: `Ви вирішуєте вилізти по скелях біля водоспаду і ризикувати своїм безпекою.
     Ваші руки шукають опору на гладких каменях, а ноги шукають стійку опору. 
     З кожним кроком ви відчуваєте, як вода з водоспаду бризкає вам у обличчя, надаючи вам сили і впевненості.
    Але, ось незворотний момент: ви розумієте, що маючи мотузку, якою можна б було зафіксуватися, можна врятуватися і подолати скелю.
     Вам спливають руки від поту, і ви відчуваєте, як втрачаєте стійкість. Серце б'ється швидше, а паніка поступово охоплює вас.`,
        options: [
            {text: "Використати мотузку", nextId: 31, requiredState:{subject:'rope',isForDelete:true}},
            {text: "І де ж я подів мотузку...", nextId: 101},//----------------START OVER--------------

        ],
    },
    {
        id: 15,
        text: `Ви вирішуєте пройти через водоспад, ризикуючи бути змоченим.
     Ви підходите ближче до водоспаду і відчуваєте його потужний потік води, що обволікає вас холодним туманом.
     З великим розмахом ви прориваєтеся через струмок і впадаєте в потік, який впродовж кількох секунд змиває всю вашу втому.
     По той бік водоспаду ви виходите змоченим, але оживленим. Ваше волосся струшуються від води, а відчуття свіжості охоплює вас. Тепер перед вами відкривається незвідана печера`,
        options: [
            {text: "Зайти і обстежити", nextId: 18,state: 'rope'},
            {text: "Я боягуз але сильний в руках, Повернуся і спробую піднятися по скелі", nextId: 14},
        ],
    },
    {
        id: 16,
        text: `16`,
        options: [
            {text: "26", nextId: 26},
            {text: "27", nextId: 27},
        ],
    },
    {
        id: 17,
        text: `17`,
        options: [
            {text: "28", nextId: 28},
            {text: "28", nextId: 29},
        ],
    },
    {
        id: 18,
        text: `Ви увіходите до печери, зачеплюєтеся за мотузку, і вирішуєте підібрати її.
         Але раптово ви помічаєте великого ведмедя, який блукає по середині печери. 
         Його гострі очі виявляють вашу присутність, і він піднімає свою голову, видно, що він напружений.
            Ви швидко перевіряєте свої ресурси щоб зрозуміти чи зможете врятуватися. 
        Ведмідь наближається до вас, його великі лапи потрясають землю. Ви відчуваєте пульсуючий страх у своєму серці, але одночасно відчуваєте рішучість.
            Знаючи, що ведмеді часто пристрастіюються до меду, а чи присутній мед зі мною? `,
        options: [
            {text: "Так! Я маю баночку меду, пригощу звіра", nextId: 30, requiredState: {subject:'honey',isForDelete:true}},  // required state Honey should be
            {text: "Хм...Я наче мав взяти його...}", nextId: 101},  // КІНЕЦЬ
        ],
    },
    {
        id: 19,
        text: `Ви приділяєте увагу деталям навколишнього ландшафту, використовуючи бінокль, сподіваючись виявити вихід з лісу. 
        Поступово, уважно оглядаючи кожен деталь, ви помічаєте слабку світлу смугу серед зелені.
        Зосередившись на цій області, ви помічаєте, що це може бути просіка або стежка, що веде з лісу. 
        Вона проходить через дерева і видно, що ширшаючись, як йдете далі.
        Ваше серце заповнюється надією, коли ви розпізнаєте знаки цивілізації: сліди людського пересування, пошкоджені гілки, маркування на деревах. 
        Це вказує на те, що ви на правильному шляху до виходу з лісу.
        З новим ентузіазмом ви спускаєтеся з гори, слідуючи за просікою і дотримуючись маркувань. 
        Відчуваючи полегшення, ви переступаєте через межу лісу і повертаєтеся до знайомого світу, відкриваючи новий етап своєї пригоди.
`,
        options: [
            {text: "Я скоро буду дома!", nextId: 201},
        ],
    },
    {
        id: 20,
        text: `Вам належить знайти інший спосіб визначити вихід з лісу, оскільки у вас немає бінокля.
        Вивчивши звуки, які доносяться з лісу. Ви звернули увагу на звук водоспаду, який лунає здалеку.
         Цей поток води може бути ознакою близкості до цивілізованої місцевості, оскільки водоспади часто знаходяться близько до населених пунктів. 
         Він служить вам орієнтиром і може вести вас до виходу з лісу.
        `,
        options: [
            {text: "Рух до водоспаду", nextId: 7},
            {text: "Вирішити знайти легший шлях", nextId: 4},
        ],
    },
    {
        id: 21,
        text: `21 взяв предмет з дна річки І 1:`,
        options: [
            {text: "32", nextId: 32},
            {text: "33", nextId: 33},
        ],
    },
    {
        id: 22,
        text: `22 взяв предмет з дна річки І 2:`,
        options: [
            {text: "34", nextId: 34},
            {text: "35", nextId: 35},
        ],
    },
    {
        id: 23,
        text: `23 Пливу далі І 1:`,
        options: [
            {text: "36", nextId: 36},
            {text: "37", nextId: 37},
        ],
    },
    {
        id: 24,
        text: `24 Пливу далі І 2:`,
        options: [
            {text: "38", nextId: 38},
            {text: "39", nextId: 39},
        ],
    },
    {
        id: 25,
        text: `Ви вирішуєте залишити човен і вирушити стежкою, яку помітили вдалеку. 
        Шлях прокладений крізь густий ліс, але ви відчуваєте, що він може привести вас до вихідного шляху.
        Після деякого часу, проходячи по стежці, ви помічаєте, як вона стає ширшою та більш виділеною. 
        Листя на землі зменшується, і ви замічаєте перший проблиск сонця через гілля. Ви все ближче до краю лісу.
        Здалеку,ви помічаєте велику скелю, яка височіє у далекому горизонті на галявині. Вона може бути наступним важливим пунктом на вашому шляху.`,
        options: [
            {text: "Підійти до скелі", nextId: 50},
            {text: "Продовжувати рухатися далі", nextId: 8},
        ],
    },
    // 26
    // 27
    // 28
    // 29
    {
        id: 30,
        text: `Ви швидко розумієте, що у вас є обмежений час, поки ведмідь зайнятий їжею.
         Ви ретельно оглядаєте печеру і помічаєте декілька цікавих предметів. 
         Серед них є Мисливський Ніж, Компас, Фляга та Кресало.
         Вам потрібно прийняти швидке рішення щодо того, який один предмет ви виберете, перед тим як покинути печеру.
         `,
        options: [
            {text: "Мисливський Ніж", nextId: 40, state: 'knife'},
            {text: "Компас", nextId: 40, state: 'compass'},
            {text: "Фляга без води", nextId: 40, state: 'bottle'},
            {text: "Кресало", nextId: 40, state: 'kresalo'},
        ],
    },
    {
        id: 40,
        text: `Ви з панікою біжите з печери, відчуваючи ведмедя, який наближається до вас. 
        Ви намагаєтеся рухатися швидко і незамітно, уникати гілок і кущів, щоб не привертати увагу. 
        Проте, ваший страх і поспішність приводять до того, що ви опинилися в густому лісі з єдинию стежкою вглиб лісу`,
        options: [
            {text: "Продовжити рухатися вглиб лісу", nextId: 4},
            {text: "Повернутися до ведмедя в печеру", nextId: 18},
        ],
    },
    {
        id: 31,
        text: `Після успішного вилазу по скелі біля водоспаду, ви знаходитесь на вершині, де вас оточує захоплюючий вид на ліс та далекі горизонти. 
                Із цього місця ви можете побачити кілька можливих шляхів, які ведуть у різні напрямки. 
         `,
        options: [
            {text: "Побачили вдалині міст та вирішили перейти на іншу сторону", nextId: 41},
            {text: "Використати ніж, щоб зловити рибу та підкріпитися", nextId: 42, requiredState:{subject: 'knife'}},
            {
                text: "Використати кресало, щоб розвести багаття, може хтось помітить і допоможе",
                nextId: 43,
                requiredState: {subject: 'kresalo'}
            },
            {text: "Продовжити рухатися вздовж берега", nextId: 44},

        ],
    },
    {
        id: 44,
        text: `Продовжуємо рухатися вздовж берега але бачимо, що шлях дуже не простий, кілька секунд роздумів і
        вирішуємо повернутися назад і перейти на інший берег річки через міст.`,
        options: [
            {text: "Переходимо через міст, шлях наче має бути простішим далі.", nextId: 41},
        ],
    },
    {
        id: 42,
        text: `Поки ви зайняті ловлею риби біля річки, ви помічаєте, що здалеку наближаються туристи. 
        Вони приходять з метою набрати воду з річки для своєї подорожі. 
        Зацікавлені у вашій ситуації, вони підходять до вас, питаючи, чи все гаразд і чи потрібна вам допомога.
        Ви розповідаєте їм про вашу загубленість у лісі і вони виявляються доброзичливими туристами, які мають досвід в походах.
         Вони пропонують допомогти вам вийти з лісу і повернутися до цивілізації.
        Туристи розповідають вам про найближчий шлях до цивілізації та навіть пропонують вам приєднатися до них, якщо ви хочете. 
        Ви вдячно приймаєте їх пропозицію і разом із ними продовжуєте подорож до виходу з лісу.
        Таким чином, завдяки зловленій рибі і доброзичливим туристам, ви успішно знаходите шлях до цивілізації та скоро повернетесь додому.`,
        options: [
            {text: "Я скоро буду дома!", nextId: 201},
        ],
    },
    {
        id: 43,
        text: `Ви вирішили використати кресало, щоб розвести багаття і привернути увагу людей.
         Ви знаєте, що дим від багаття може бути помітним здалеку і приверне увагу потенційних рятівників.
          Під час розпалювання багаття ви втратили пильність і не помітили, як хижий звір підійшов до водопою та
          нападає на вас, не давши вам шансу втекти`,
        options: [
            {text: "Все життя пролетіло перед очима...", nextId: 101},
        ],
    },
    {
        id: 41,
        text: `Після успішного перетину мосту ви потрапили в невелике поселення. Місцеві жителі часто ходять до річки, щоб половити рибу та набрати воду.
         Вони люб'язно допомагають вам і вказують напрямок до невеликої галявини, розташованої у лісі. Це новий орієнтир, який може вести вас далі.`,
        options: [
            {text: "Дякуєте місцевим жителям за їхню допомогу і відправляєтеся до галявини.", nextId: 45},
        ],
    },
    {
        id: 45,
        text: `Ви опинилися на галявині і раптово зустріли розбійників. Вони загрожують вам, вимагаючи від вас цінні речі.
         Якщо у вас є щось коштовне, вони погоджуються відвезти вас до найближчого міста, а ваші речі забрати собі. Ваше життя буде врятовано, але ви втратите цінні власності.
         Але якщо у вас нічого коштовного немає, розбійники вирішують утримати вас в полоні. 
         Ви знаходитесь під їхнім контролем і не можете втекти.`,
        options: [
            {text: "Віддати кришталевий кулон", nextId: 46,requiredState: {subject:'crystal',isForDelete:true}},
            {text: "Якщо щось і є, я надійно сховав і не віддам", nextId: 47},
        ],
    },
    {
        id: 46,
        text: `Ви розумно вирішили віддати розбійникам кулон і домовитися з ними.
         Розбійники беруть цінний предмет і погоджуються підвезти вас до найближчого міста або цивілізації. 
         Ваша безпека є пріоритетом, і ви бачите, що це кращий варіант, ніж залишатися в полоні.
            Розбійники провадять вас до місця, де ви зможете знайти допомогу і повернутися до цивілізованого світу.
             Ви відчуваєте полегшення, коли побачили ознаки людської присутності та цивілізації.`,
        options: [
            {text: "Дякуємо за поверненню до цивілізації", nextId: 201},
        ],
    },
    {
        id: 47,
        text: `Потрапляю в полон. Перебуваючи з розбійниками кілька днів, вирішєте приєднатися до розбійників.
               Ви стаєте одним з розбійників і приймаєте їхні звички та способи життя.
               Ви втрачаєте свободу, але отримуєте певні переваги, які надає бути розбійником. 
               Ви знаходите сховки, плануєте злочини та збираєте незаконний здобуток.
        `,
        options: [
            {text: "Краще ніж загинути в лісі)", nextId: 101},
        ],
    },
];

let initialState: [] = []


const findStateById = (id: number): IGameState => {
    for (const state of gameStates) {
        if (state.id === id) {
            return state;
        }
    }
    return gameStates[0]
}


// Function to start the game
function startGame() {
    initialState = [];
    const state = findStateById(0)
    showGameState(state);
}

function showOption(option: IOption): boolean {
    if (!option?.requiredState) return true
    const subject = option.requiredState.subject;
    // @ts-ignore
    const hasSubject = initialState.includes(subject);
    if (hasSubject && option?.requiredState?.isForDelete) {
        // @ts-ignore
        initialState = initialState.filter(el => el !== subject) || [];
    }
    return hasSubject
}

// Function to display the current game state
function showGameState(state: IGameState): void {
    const textElement = document.getElementById("text");
    const optionsElement = document.getElementById("options");

    textElement!.innerText = state.text;
    optionsElement!.innerHTML = "";

    state.options.forEach((option) => {
        if (showOption(option)) {
            const button = document.createElement("button");
            button.innerText = option.text;
            button.addEventListener("click", () => selectOption(option));
            optionsElement!.appendChild(button);
        }
    });
}

// Function to handle option selection
function selectOption(option: IOption): void {
    const nextState = findStateById(option.nextId)
    // @ts-ignore
    option?.state && initialState.push(option?.state)

    if (nextState) {
        showGameState(nextState);
    }
}

// Start the game
startGame();
